brew 'bat'
# brew 'chezmoi'
brew 'chruby-fish'
brew 'exa'
brew 'fish'
brew 'grc'
# brew 'highlight'
brew 'httpie'
# brew 'hugo'
brew 'mas'
brew 'nodenv'
brew 'redis'
brew 'shellcheck'
brew 'tldr'
brew 'yarn'

# Install these on home machines only
{{- if eq .location "home" }}
cask 'beatport-pro'
cask 'bookmacster'
cask 'dupeguru'
cask 'forklift'
cask 'gemini'
cask 'native-access'
cask 'screenflow'
# cask 'superduper'
cask 'quicken'
cask 'vlc'
# cask 'airfoil'
cask 'audio-hijack'
# cask 'beardedspice'
# cask 'charles'
# cask 'espresso'
# cask 'gitbook-editor'
# cask 'insomnia'
# cask 'reflector'
# cask 'spamsieve'
# cask 'vox'
# cask 'wiretap-studio'
{{- end }}

# Install these on work machines only
{{- if eq .location "work" }}
cask 'goland'
cask 'harvest'
cask 'keka'
cask 'microsoft-teams'
cask 'tableplus'
{{- end }}

cask 'alfred'
# cask 'anki'
# cask 'ankiapp-anki'
cask 'appzapper'
cask 'backblaze'
# cask 'brave-browser'
# cask 'caret'
cask 'cheatsheet'
cask 'dash'
cask 'discord'
cask 'docker'
# cask 'do-not-disturb'
cask 'dropbox'
cask 'farrago'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
# cask 'keybase'
cask 'keyboard-maestro'
cask 'knockknock'
cask 'loopback'
# cask 'lulu'
# cask 'notion'
# cask 'oversight'
# cask 'postman'
# cask 'reikey' # requires password?
# cask 'skype'
cask 'spotify'
cask 'sublime-text'
cask 'timing'
cask 'tower'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'zoom'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
# cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

mas '1Password', id: 1333542190
mas 'Bear', id: 1091189122
mas 'Better', id: 1121192229
mas 'BreakTime', id: 427475982
mas 'Ghostery Lite', id: 1436953057
mas 'Moom', id: 419330170
mas 'PopClip', id: 445189367
mas 'Slack', id: 803453959
mas 'TweetDeck', id: 485812721

# Install these on home machines only
{{- if eq .location "home" }}
mas 'Duplicate Detective', id: 686428787
mas 'Evernote', id: 406056744
mas 'Mactracker', id: 430255202
mas 'TwistedWave', id: 408452636
mas 'WhatsApp', id: 1147396723
mas 'WireGuard', id: 1451685025
{{- end }}

## Not in mas or App Store
# Duplicate Detective 2
# Korg M1

## To buy
# Logic Pro X
# Pixelmator Pro

## installed previously. worth another look?
# Agenda
# anki
# coconutbattery
# gradient
# handbrake
# induction
# loopcloud
# marked 2
# micro snitch
# popkey
# soundflower
# standard notes
# stuffit expander
# terminal-notifier
# tidy up
